simulation/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;

}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    classroom
    {
        type            zeroGradient;
    }
    
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            uniformFixedValue;
        uniformValue    constant $pressure;
    }

    frontAndBack
    {
        type            slip;
    }

    lowerWall
    {
        type            zeroGradient;
    }

    upperWall
    {
        type            slip;
    }

}

// ************************************************************************* //
