simulation/0/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

Uref                 2.0;
Zref                 10;
zDir                 (0 0 1);
flowDir              (0 1 0);
z0                   uniform 0.1;
zGround              uniform 0;

// ************************************************************************* //
