simulation/0/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

flowVelocity         (0 0 0);
pressure             0;
turbulentKE          1.5;
turbulentEpsilon     0.03;

// ************************************************************************* //
